src/DataProcessors/ЗагрузкаАРВССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаАРВССайта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перезаписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьИз77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаССайтомВозвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаССайтомВозвраты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СобытияКОбработкеАктовРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияКОбработкеАктовРассмотренияВозврата</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрСобытияПроцессаВозвратов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийКОбработкеПроцессаВозвратов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/_ДляПереносаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>_ДляПереносаДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Число77</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыУценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыУценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОднойДетали</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛиквидности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛиквидности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараВНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцизный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЛогистическая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ_ГруппыЛогистические</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТоварная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ_ГруппыТоварные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗагрузкаАРВССайта/Ext/ObjectModule.bsl
Перем мЗаписыватьИсториюОбмена;

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	КаталогОбмена = ВозвратыОтПокупателяСервер.КаталогОбменаССайтом(Ложь, Истина, 1);
	ВыполнитьЗагрузку();
		
КонецПроцедуры

Процедура ВыполнитьЗагрузку() Экспорт
	
	ВыполнитьЗагрузкуАРВИзКаталога();
	
	ВыполнитьЗагрузкуНомеровКлиента();
	
КонецПроцедуры

//Загрузка номера и даты клиента
Процедура ВыполнитьЗагрузкуНомеровКлиента() Экспорт
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ВыполнитьЗагрузкуНомеровКлиента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Возврат;
	
	Если Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеФайлы = НайтиФайлы(КаталогОбмена, "return_docs_*.txt");
	
	Для каждого НайденныйФайл Из НайденныеФайлы Цикл
		
		ТекстОшибки = "";
		РезультатЗагрузки = ВыполнитьЗагрузкуНомеровИзФайла(НайденныйФайл, ТекстОшибки);
		
		ОтветОтправлен = ОтправитьОтвет(НайденныйФайл.ИмяБезРасширения,
		РезультатЗагрузки.Штрихкод, 
		РезультатЗагрузки.АктЗаписан, 
		РезультатЗагрузки.НомераДокументовКлиентаПолучены, 
		РезультатЗагрузки.ТекстОшибки);
		
		Если ОтветОтправлен И НайденныйФайл.Существует() Тогда
			УдалитьФайлы(НайденныйФайл.ПолноеИмя);			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтрокаДатой(вхСтрока)
	
	Мас = СтрРазделить(вхСтрока, ".", Истина);
	
	Возврат Дата(Мас[2], Мас[1], Мас[0]);
	
	
КонецФункции

Функция ВыполнитьЗагрузкуНомеровИзФайла(вхФайл, ТекстОшибки = "")
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ВыполнитьЗагрузкуНомеровИзФайла";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ВозвращаемоеЗначение = Новый Структура("Штрихкод, АктЗаписан, НомераДокументовКлиентаПолучены, ТекстОшибки", "", Ложь, Ложь, "");
	
	ЧтениеТекста = Новый ЧтениеТекста(вхФайл.ПолноеИмя);
	ТекстФайла  = ЧтениеТекста.Прочитать();
	МассивДанныхФайла =	СтрРазделить(ТекстФайла, Символы.ПС,Истина);
	
	Если МассивДанныхФайла.Количество() <> 11 Тогда
		ТекстОшибки = "Неверная структура файла";
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
		
	НомерРТУ = МассивДанныхФайла[6];
	Если СтрДлина(НомерРТУ) < 11 Тогда 
		НомерРТУ=Лев(НомерРТУ,4)+"0"+Сред(НомерРТУ,5);
	КонецЕсли;	

	
	МассивНомерДатаРТУКлиента = СтрРазделить(МассивДанныхФайла[9], ";", Истина);
	НомерРТУКлиента = МассивНомерДатаРТУКлиента[0];
	ДатаРТУКлиента 	= СтрокаДатой(МассивНомерДатаРТУКлиента[1]);
	
	МассивНомерДатаСчФКлиента = СтрРазделить(МассивДанныхФайла[10], ";", Истина);
	НомерСчФКлиента = МассивНомерДатаСчФКлиента[0];
	ДатаСчФКлиента 	= СтрокаДатой(МассивНомерДатаСчФКлиента[1]);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктРассмотренияВозврата.Ссылка
		|ИЗ
		|	Документ.АктРассмотренияВозврата КАК АктРассмотренияВозврата
		|ГДЕ
		|	АктРассмотренияВозврата.ДокументПродажи.Номер = &Номер
		|	И АктРассмотренияВозврата.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ АктРассмотренияВозврата.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаНач", 	ДобавитьМесяц(ТекущаяДата(),-3));
	Запрос.УстановитьПараметр("ДатаКон", 	ДобавитьМесяц(ТекущаяДата(),3));
	Запрос.УстановитьПараметр("Номер", 		НомерРТУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ВозвращаемоеЗначение.ТекстОшибки = "Не найден акт возврата по накладной с номером "+НомерРТУ;
		Возврат ВозвращаемоеЗначение;
	ИначеЕсли Выборка.Количество() > 1 Тогда
		ВозвращаемоеЗначение.ТекстОшибки = "Найдено несколько актов возврата для накладной с номером "+НомерРТУ;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Выборка.Следующий();
	ВозвращаемоеЗначение.АктЗаписан = Истина; //мы его нашли
	
	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	ДокументОбъект.НомерНакладнойКлиента 	= НомерРТУКлиента;
	ДокументОбъект.ДатаНакладнойКлиента 	= ДатаРТУКлиента;
	ДокументОбъект.НомерСчетаФактурыКлиента = НомерСчФКлиента;
	ДокументОбъект.ДатаСчетаФактурыКлиента 	= ДатаСчФКлиента;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		//Ошибка заполнения документа
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
		, 
		Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиАРВССайта,
		ТекстОшибки,
		,
		Истина,
		вхФайл.ПолноеИмя + "
		|
		| Ошибка: " + ТекстОшибки + "
		|
		| Файл: " + ТекстФайла,
		"Обработка: Загрузка АРВ с сайта");
		
		Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);
		
		Возврат ВозвращаемоеЗначение;

	Иначе
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ВозвращаемоеЗначение.НомераДокументовКлиентаПолучены = Истина;
		Исключение
			
			ОписаниеОшибки = ОписаниеОшибки();
			ДобавитьвТекстОшибки("Ошибка при проведении акта: " +ОписаниеОшибки, ТекстОшибки);
			
			//Ошибка проведения документа
			КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
			, 
			Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиАРВССайта,
			ТекстОшибки,
			,
			Истина,
			вхФайл.ПолноеИмя + "
			|
			| Ошибка: " + ТекстОшибки + "
			|
			| Файл: " + ТекстФайла,
			"Обработка: Загрузка АРВ с сайта");
			
			Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если мЗаписыватьИсториюОбмена Тогда
		РегистрыСведений.ИсторияОбменаССайтомВозвраты.Добавить(
		вхФайл.ПолноеИмя,
		ДокументОбъект.Ссылка,
		ТекстФайла,
		НЕ ВозвращаемоеЗначение.АктЗаписан,
		ТекстОшибки,
		Ложь);
	КонецЕсли;
	
	ВозвращаемоеЗначение.Штрихкод 							= ДокументОбъект.Штрихкод;
	ВозвращаемоеЗначение.ТекстОшибки 						= ТекстОшибки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

//Загрузка АРВ
Процедура ВыполнитьЗагрузкуАРВИзКаталога() Экспорт
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ВыполнитьЗагрузкуАРВИзКаталога";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(КаталогОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОшибок = КаталогОбмена+"errors\";
	
	НайденныеФайлы = НайтиФайлы(КаталогОбмена, ?(ЗначениеЗаполнено(МаскаФайла), МаскаФайла, "return_request_*.xml"));
	Для каждого НайденныйФайл Из НайденныеФайлы Цикл
		ТекстОшибки = "";
		РезультатЗагрузки = ВыполнитьЗагрузкуИзФайла(НайденныйФайл, ТекстОшибки);
		
		ОтветОтправлен = ОтправитьОтвет(НайденныйФайл.ИмяБезРасширения,
		РезультатЗагрузки.Штрихкод, 
		РезультатЗагрузки.АктЗаписан, 
		РезультатЗагрузки.НомераДокументовКлиентаПолучены, 
		РезультатЗагрузки.ТекстОшибки);
		
		Если НайденныйФайл.Существует() Тогда
			Если ОтветОтправлен	И РезультатЗагрузки.АктЗаписан Тогда
				УдалитьФайлы(НайденныйФайл.ПолноеИмя);
			Иначе
				СоздатьКаталог(КаталогОшибок);
				ПереместитьФайл(НайденныйФайл.ПолноеИмя, КаталогОшибок+НайденныйФайл.Имя);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры   

Функция ВыполнитьЗагрузкуИзФайла(вхФайл, ТекстОшибки = "")
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ВыполнитьЗагрузкуИзФайла";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ВозвращаемоеЗначение = Новый Структура("Штрихкод, АктЗаписан, НомераДокументовКлиентаПолучены, ТекстОшибки");
	
	ЧтениеТекста = Новый ЧтениеТекста(вхФайл.ПолноеИмя, );
	ТекстФайла  = ЧтениеТекста.Прочитать();

	СтруктураДанныхФайла = СтруктураДанныхФайла(вхФайл);
	
	СтруктураДанныхАкта = ЗаполнитьСтруктуруДанныхАкта(СтруктураДанныхФайла);
	
	ТекстОшибки = "";
	РезультатСоздания = СоздатьАРВ(СтруктураДанныхАкта, ТекстОшибки);
	ДокументОбъект = РезультатСоздания.ДокументОбъект;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		//Ошибка заполнения документа
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
		, 
		Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиАРВССайта,
		ТекстОшибки,
		,
		Истина,
		вхФайл.ПолноеИмя + "
		|
		| Ошибка: " + ТекстОшибки + "
		|
		| Файл: " + ТекстФайла,
		"Обработка: Загрузка АРВ с сайта");
		
		Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);
		
		Если РезультатСоздания.ДокументУжеЕсть Тогда
			ВозвращаемоеЗначение.АктЗаписан = Истина;
		Иначе
			ВозвращаемоеЗначение.АктЗаписан = Ложь;
		КонецЕсли;
	Иначе
		
		НачатьТранзакцию();
		Попытка
			//ДокументОбъект.ОбменДанными.Загрузка = Истина;
			//ДокументОбъект.Записать();
			//ДокументОбъект.ОбменДанными.Загрузка = Ложь;
			
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ВозвращаемоеЗначение.АктЗаписан = Истина;
			
			РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(
			ДокументОбъект.Ссылка,
			Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус,
			ДокументОбъект.СтатусДокумента);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			ДобавитьвТекстОшибки("Ошибка при проведении акта: " +ОписаниеОшибки, ТекстОшибки);
			
			//Ошибка проведения документа
			КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
			, 
			Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиАРВССайта,
			ТекстОшибки,
			,
			Истина,
			вхФайл.ПолноеИмя + "
			|
			| Ошибка: " + ТекстОшибки + "
			|
			| Файл: " + ТекстФайла,
			"Обработка: Загрузка АРВ с сайта");
			
			Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);
			
			ВозвращаемоеЗначение.АктЗаписан = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Если мЗаписыватьИсториюОбмена Тогда
		РегистрыСведений.ИсторияОбменаССайтомВозвраты.Добавить(
		вхФайл.ПолноеИмя,
		ДокументОбъект.Ссылка,
		ТекстФайла,
		НЕ ВозвращаемоеЗначение.АктЗаписан,
		ТекстОшибки,
		Ложь);
	КонецЕсли;
	
	ВозвращаемоеЗначение.Штрихкод 							= СтруктураДанныхАкта.Штрихкод;
	ВозвращаемоеЗначение.НомераДокументовКлиентаПолучены 	= Ложь;
	ВозвращаемоеЗначение.ТекстОшибки 						= ТекстОшибки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СоздатьАРВ(СтруктураДанныхАкта, ТекстОшибки = "")
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_СоздатьАРВ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДокументОбъект");
	ВозвращаемоеЗначение.Вставить("ДокументУжеЕсть", Ложь);
	
	//Шапка
	НайденныйДокумент = Документы.АктРассмотренияВозврата.НайтиПоРеквизиту("Штрихкод", СтруктураДанныхАкта.Штрихкод);
	Если Перезаписывать И ЗначениеЗаполнено(НайденныйДокумент) Тогда
		ДокументОбъект = НайденныйДокумент.ПолучитьОбъект();
	Иначе
		Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
			ДобавитьВТекстОшибки("Акт возврата с идентификатором """+СтруктураДанныхАкта.Штрихкод+""" уже существует", ТекстОшибки);
			ВозвращаемоеЗначение.ДокументУжеЕсть = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		ДокументОбъект = Документы.АктРассмотренияВозврата.СоздатьДокумент();
	КонецЕсли;
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.СтатусДокумента = Справочники.СтатусыДокументов.АРВ_Новый;
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураДанныхАкта);
	
	ДокументОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду(СтруктураДанныхАкта.КодКонтрагента);
	Если Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		ДобавитьвТекстОшибки("Не найден контрагент с кодом """+СтруктураДанныхАкта.КодКонтрагента+"""", ТекстОшибки);
	КонецЕсли;
	

	ДокументОбъект.ДокументПродажи = ДокументПродажи(СтруктураДанныхАкта.НомерРТУ,  СтруктураДанныхАкта.ДатаРТУ, ДокументОбъект.Контрагент);
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
		ДокументОбъект.ДокументПродажи = ДокументПродажи(СтруктураДанныхАкта.НомерРТУ2,  СтруктураДанныхАкта.ДатаРТУ2, ДокументОбъект.Контрагент);
	КонецЕсли;
	
	//Попробуем получить из базы 77 спб
	Если ЗагружатьИз77 Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
			//Если найденная рту была загружена из 77, то перезаполним её
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	_ДляПереносаДанных.Объект
			|ИЗ
			|	РегистрСведений._ДляПереносаДанных КАК _ДляПереносаДанных
			|ГДЕ
			|	_ДляПереносаДанных.Объект = &Объект";
			
			Запрос.УстановитьПараметр("Объект", ДокументОбъект.ДокументПродажи);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				ПараметрыПолучения = Новый Структура("Номер77,Дата77,ПерезаполнятьШапку,ПерезаполнятьТЧТовары",
				СтруктураДанныхАкта.НомерРТУ,СтруктураДанныхАкта.ДатаРТУ,Истина,Истина);
				НайденныйДокумент = ОбменДаннымиВызовСервера.ПолучитьДокументИз77(ПараметрыПолучения);
				Если Не ЗначениеЗаполнено(НайденныйДокумент) Тогда
					ПараметрыПолучения.Номер77 		 = СтруктураДанныхАкта.НомерРТУ2;
					ПараметрыПолучения.Дата77		 = СтруктураДанныхАкта.ДатаРТУ2;
					ОбменДаннымиВызовСервера.ПолучитьДокументИз77(ПараметрыПолучения);
				КонецЕсли;
				
			КонецЕсли;
			
			
		Иначе
			
			ПараметрыПолучения = Новый Структура("Номер77,Дата77,ПерезаполнятьШапку,ПерезаполнятьТЧТовары",
			СтруктураДанныхАкта.НомерРТУ,СтруктураДанныхАкта.ДатаРТУ,Истина,Истина);
			
			ДокументОбъект.ДокументПродажи = ОбменДаннымиВызовСервера.ПолучитьДокументИз77(ПараметрыПолучения);
			Если Не ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
				ПараметрыПолучения.Номер77 		 = СтруктураДанныхАкта.НомерРТУ2;
				ПараметрыПолучения.Дата77		 = СтруктураДанныхАкта.ДатаРТУ2;
				ДокументОбъект.ДокументПродажи 	 = ОбменДаннымиВызовСервера.ПолучитьДокументИз77(ПараметрыПолучения);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;


	Если Не ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
		ДобавитьвТекстОшибки("Не найден документ продажи с номерами """+СтруктураДанныхАкта.НомерРТУ2+""" / """+СтруктураДанныхАкта.НомерРТУ+""" от "+СтруктураДанныхАкта.ДатаРТУ2+""" / """+СтруктураДанныхАкта.ДатаРТУ, ТекстОшибки);
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
		ДокументОбъект.ДоговорКонтрагента = ДокументОбъект.ДокументПродажи.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		ДокументОбъект.Организация = ДокументОбъект.ДоговорКонтрагента.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанныхАкта.КодВозврата) 
		И Число(СтруктураДанныхАкта.КодВозврата) <> 0 Тогда
		КодВозвратаСсылка = Справочники.КодыВозврата.НайтиПоКоду(Число(СтруктураДанныхАкта.КодВозврата));
		ДокументОбъект.КодВозврата = КодВозвратаСсылка;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ДокументОбъект.КодВозврата) Тогда
	//	ДобавитьвТекстОшибки("Не найден код возврата", ТекстОшибки);
	//КонецЕсли;
	    
	СоответствиеПричинВозврата = СоответствиеПричинВозврата();
	ПричинаВозврата = СоответствиеПричинВозврата.Получить(СтруктураДанныхАкта.ПричинаВозврата);
	Если Не ЗначениеЗаполнено(ПричинаВозврата) Тогда
		ДобавитьвТекстОшибки("Не найдена причина возврата для причины сайта: "+СтруктураДанныхАкта.ПричинаВозврата, ТекстОшибки);
	КонецЕсли;
	
	Если ПричинаВозврата = Справочники.ПричиныВозврата.БракВыявленныйДоУстановки
		ИЛИ ПричинаВозврата = Справочники.ПричиныВозврата.БракВыявленныйПослеУстановки Тогда
		ДокументОбъект.ПодпричинаВозврата = ПричинаВозврата;
		ПричинаВозврата =  Справочники.ПричиныВозврата.БракВыявленныйПослеПолученияТовара;
	КонецЕсли;
	ДокументОбъект.ПричинаВозврата = ПричинаВозврата;
	
	Если СтруктураДанныхАкта.БезоговорочныйВозврат = "Безоговорочный" Тогда
		ДокументОбъект.БезоговорочныйВозврат = Истина;		
	КонецЕсли;
	
	ДокументОбъект.СуммаКомпенсации 	= СтруктураДанныхАкта.СуммаКомпенсации;

	ВариантУчетаНДС = УчетНДСПовтИсп.ВариантУчетаНДСОрганизации(ДокументОбъект.Организация);
	ДокументОбъект.УчитыватьНДС 		= УчетНДСПовтИсп.УчитыватьНДСПоВариантуУчета(ВариантУчетаНДС, ДокументОбъект.ДоговорКонтрагента.ВидОплаты); 
	ДокументОбъект.СуммаВключаетНДС 	= ДокументОбъект.УчитыватьНДС;
	
	
	//Поиск строки заявки в РТУ	
	ТаблицаДляПоискаSSID = Новый ТаблицаЗначений;
	ТаблицаДляПоискаSSID.Колонки.Добавить("SSID");
	ТаблицаДляПоискаSSID.Добавить().SSID =  СтруктураДанныхАкта.SSID;
	СоотвSSID = ОбменДаннымиКлиентСервер.СоответствиеСтрокЗаявокИSSID(ТаблицаДляПоискаSSID, ДокументОбъект.ДокументПродажи); 
	СтрокаЗаявки = ОбменДаннымиКлиентСервер.НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, СтруктураДанныхАкта.SSID);
	Если Не ЗначениеЗаполнено(СтрокаЗаявки) Тогда 
		ДобавитьВТекстОшибки("Не найдена строка заявки с SSID """+СтруктураДанныхАкта.SSID+"""", ТекстОшибки);
	КонецЕсли;
	
	//Товары документа продажи
	Если ЗначениеЗаполнено(СтруктураДанныхАкта.НоменклатураУИД) Тогда
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанныхАкта.НоменклатураУИД));
		Если НЕ ОбщегоНазначения.СсылкаСуществует(Номенклатура) Тогда
			Номенклатура = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК Код,
		|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
		|	РеализацияТоваровУслугТовары.Номенклатура.Изготовитель КАК Изготовитель,
		|	РеализацияТоваровУслугТовары.Номенклатура.Изготовитель.Наименование КАК ИзготовительНаименование
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.ДокументПродажи);
		ТоварыДокументаПродажи = Запрос.Выполнить().Выгрузить();
		СтрокиТоваров = ТоварыДокументаПродажи.НайтиСтроки(Новый структура("Артикул", СтруктураДанныхАкта.НоменклатураАртикул));
		Если СтрокиТоваров.Количество() = 0 Тогда
			ДобавитьвТекстОшибки("Не найдена номенклатура по артикулу "+СтруктураДанныхАкта.НоменклатураАртикул+", в документе продажи "+ДокументОбъект.ДокументПродажи, ТекстОшибки);
		Иначе
			Номенклатура = СтрокиТоваров[0].Номенклатура;
		КонецЕсли;
	КонецЕсли;	
			
	//Товары
	ДокументОбъект.Товары.Очистить();
	НоваяСтрока = ДокументОбъект.Товары.Добавить();
	НоваяСтрока.СтрокаЗаявки 		= СтрокаЗаявки;
	НоваяСтрока.СуммаКомпенсации 	= СтруктураДанныхАкта.СуммаКомпенсации;
	НоваяСтрока.СуммаУценки 		= СтруктураДанныхАкта.СуммаУценки;
	НоваяСтрока.ПроцентУценки 		= СтруктураДанныхАкта.ПроцентУценки;
	Если СтруктураДанныхАкта.ВидУценки = "Обработка одной детали" Тогда
		НоваяСтрока.ВидУценки = Перечисления.ВидыУценки.ОбработкаОднойДетали;
	ИначеЕсли НоваяСтрока.ПроцентУценки > 0 Тогда
		НоваяСтрока.ВидУценки = Перечисления.ВидыУценки.УценкаЗаТовар;
	КонецЕсли;
	
	НоваяСтрока.Номенклатура = Номенклатура;
	Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
		//ДобавитьвТекстОшибки("Не найдена номенклатура по коду "+СтруктураДанныхАкта.НоменклатураКод, ТекстОшибки);
	КонецЕсли;
	
	НоваяСтрока.КоличествоПлан = СтруктураДанныхАкта.КоличествоПлан;
	Если Не ЗначениеЗаполнено(НоваяСтрока.КоличествоПлан) Тогда
		ДобавитьвТекстОшибки("Не указано количество", ТекстОшибки);
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков, ЕдиницаХраненияОстатков.Коэффициент, СтавкаНДС");
	НоваяСтрока.СтавкаНДС 			= РеквизитыНоменклатуры.СтавкаНДС;
	НоваяСтрока.ЕдиницаИзмерения 	= РеквизитыНоменклатуры.ЕдиницаХраненияОстатков;
	НоваяСтрока.Коэффициент 		= РеквизитыНоменклатуры.ЕдиницаХраненияОстатковКоэффициент;
	
	НоваяСтрока.ОтсутствуютСледыУстановки 	= СтруктураДанныхАкта.ОтсутствуютСледыУстановки = "true";
	НоваяСтрока.ЦелостностьУпаковки 		= СтруктураДанныхАкта.ЦелостностьУпаковки = "true";
	
	//Подберем партии по РТУ
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументПродажи) Тогда
		ДокументОбъект.ПроверитьЗаполнитьПартииВТабличнойЧасти(Истина, ТекстОшибки, Ложь);
		ДокументОбъект.ЗаполнитьЦеныПоДокументуРеализации(Истина, ТекстОшибки, Ложь);
	КонецЕсли;
	
	ДокументОбъект.Комментарий = СтрЗаменить(ДокументОбъект.Комментарий, "&ndash;", "-");
	
	ДокументОбъект.Поставщик = Документы.АктРассмотренияВозврата.ПоставщикПоДаннымПартий(ДокументОбъект);
	
	//#XX-2209 Kalinin V.A. ( 2019-05-08 )  /*
	ЗаполнитьЗначенияСвойств(ДокументОбъект,СтруктураДанныхАкта,"АдресЭлектроннойПочтыПокупателя,ИмяКонтактногоЛицаПокупателя,ТелефонПокупателя");
	// */
	
	ВозвращаемоеЗначение.ДокументОбъект = ДокументОбъект;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ДобавитьвТекстОшибки(ДобавляемыйТекст, ТекстОшибки)
	
	ТекстОшибки = ТекстОшибки + Символы.ПС +ДобавляемыйТекст;
КонецПроцедуры

Функция ДокументПродажи(знач НомерРТУ, ДатаРТУ, Контрагент = Неопределено)
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ДокументПродажи";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	
	Если СтрДлина(НомерРТУ) < 11 Тогда 
		НомерРТУ=Лев(НомерРТУ,4)+"0"+Сред(НомерРТУ,5);
	КонецЕсли;	
	
	ДокументПродажи = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Контрагент = &Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Контрагент = &Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНач", 			ДобавитьМесяц(ДатаРТУ, -9));
	Запрос.УстановитьПараметр("ДатаКон", 			ДобавитьМесяц(ДатаРТУ, 9));
	Запрос.УстановитьПараметр("Номер", 				НомерРТУ);
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	Запрос.УстановитьПараметр("ВсеКонтрагенты", 	Не ЗначениеЗаполнено(Контрагент));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументПродажи = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ДокументПродажи; 
	
КонецФункции

Функция ЗаполнитьСтруктуруДанныхАкта(СтруктураДанныхФайла)
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ЗаполнитьСтруктуруДанныхАкта";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураДанныхАкта = ИнициализироватьСтруктуруДанныхАкта();
	
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "Штрихкод", 					"IDZaprosa"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "КомментарийСайт", 			"Opisanie"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "КодКонтрагента", 			"Элмакод"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НоменклатураКод", 			"KodTovara1S"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НоменклатураАртикул", 		"Artikul"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НоменклатураИзготовитель", 	"Izgotovitelj"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НоменклатураНаименование", 	"NaimenovanieDetali");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НоменклатураУИД", 			"KodTovara1S8");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "КоличествоПлан", 			"KolVo"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "SSID", 						"SiteID"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ОтсутствуютСледыУстановки", 	"OtsutstvieSledovUstanovki"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ЦелостностьУпаковки", 		"CelostnostjUpakovki"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "СуммаКомпенсации", 			"KompensaciyaRabotTrebovanieDenjgi"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ПричинаВозврата", 			"PrichinaVozvrata"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "БезоговорочныйВозврат", 		"BezogovorochnyyVozvrat1"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НомерРТУ2", 					"NomerNakladnoyNaOtgruzkuKlientu");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "НомерРТУ", 					"PoNakladnoy");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "Вложения", 					"SsylkaNaZagruzhennyeMaterial"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "КодВозврата", 				"ChtoBudetSTovaromPosleVozvra"); 
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "VIN", 						"VINKod");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "СуммаУценки", 				"ObrabotkaDetali");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ВидУценки", 					"VidUcenki");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ПроцентУценки", 				"ProcentUcenkiZaTovarProcentUcenkiOt");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ПроцентУценкиТочный", 		"ProcentUcenkiZaTovarTochnyyProcent");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ЦенаПослеУценки", 			"CenaDetaliPosleUcenki");
	
	//#XX-2209 Kalinin V.A. ( 2019-05-08 )  /*
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "АдресЭлектроннойПочтыПокупателя", "BuyerEmail");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ИмяКонтактногоЛицаПокупателя", "BuyerName");
	ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, "ТелефонПокупателя", 			"BuyerPhone");
	// */
	
	
	СтруктураДанныхАкта.ДатаРТУ2	 					= ДатаXML_в_ДатаВремя1С(СтруктураДанныхФайла.DataNakladnoyNaOtgruzkuKlientu);
	СтруктураДанныхАкта.ДатаРТУ	 						= ДатаXML_в_ДатаВремя1С(СтруктураДанныхФайла.DataNakladnoy);
	СтруктураДанныхАкта.СрокВозвратаКлиента	 			= ДатаXML_в_ДатаВремя1С(СтруктураДанныхФайла.VernutjNaSkladDo2);

	Возврат СтруктураДанныхАкта;
	
КонецФункции

Процедура ЗаполнитьСвойствоСтруктурыАкта(СтруктураДанныхАкта, СтруктураДанныхФайла, ИмяСвойстваАкта, ИмяСвойстваФайла); 
	
	Если СтруктураДанныхФайла.Свойство(ИмяСвойстваФайла) Тогда
		СтруктураДанныхАкта[ИмяСвойстваАкта] = СтруктураДанныхФайла[ИмяСвойстваФайла];
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьСтруктуруДанныхАкта()
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ИнициализироватьСтруктуруДанныхАкта";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураДанныхАкта = Новый Структура;
	
	СтруктураДанныхАкта.Вставить("Штрихкод");
	СтруктураДанныхАкта.Вставить("КомментарийСайт");
	СтруктураДанныхАкта.Вставить("БезоговорочныйВозврат");
	СтруктураДанныхАкта.Вставить("ПричинаВозврата");
	СтруктураДанныхАкта.Вставить("СрокВозвратаКлиента");
	СтруктураДанныхАкта.Вставить("КодВозврата");
	
	СтруктураДанныхАкта.Вставить("КодКонтрагента");
	СтруктураДанныхАкта.Вставить("НоменклатураКод");
	СтруктураДанныхАкта.Вставить("НоменклатураАртикул");
	СтруктураДанныхАкта.Вставить("НоменклатураИзготовитель");
	СтруктураДанныхАкта.Вставить("НоменклатураНаименование");
	СтруктураДанныхАкта.Вставить("НоменклатураУИД");
	СтруктураДанныхАкта.Вставить("КоличествоПлан");
	СтруктураДанныхАкта.Вставить("SSID");
	СтруктураДанныхАкта.Вставить("ОтсутствуютСледыУстановки", Истина);
	СтруктураДанныхАкта.Вставить("ЦелостностьУпаковки", Истина);
	СтруктураДанныхАкта.Вставить("СуммаКомпенсации", 0);
	СтруктураДанныхАкта.Вставить("VIN");
	СтруктураДанныхАкта.Вставить("ВидУценки");
	СтруктураДанныхАкта.Вставить("СуммаУценки");
	СтруктураДанныхАкта.Вставить("ПроцентУценки");
	СтруктураДанныхАкта.Вставить("ПроцентУценкиТочный");
	СтруктураДанныхАкта.Вставить("ЦенаПослеУценки");
	
	
	СтруктураДанныхАкта.Вставить("НомерРТУ");
	СтруктураДанныхАкта.Вставить("ДатаРТУ");
	СтруктураДанныхАкта.Вставить("НомерРТУ2");
	СтруктураДанныхАкта.Вставить("ДатаРТУ2");
	
	СтруктураДанныхАкта.Вставить("Вложения");
	//#XX-2347 Kalinin V.A. ( 2019-05-13 )  /*
	СтруктураДанныхАкта.Вставить("АдресЭлектроннойПочтыПокупателя");
	СтруктураДанныхАкта.Вставить("ИмяКонтактногоЛицаПокупателя");
	СтруктураДанныхАкта.Вставить("ТелефонПокупателя");
	// */
	
	Возврат СтруктураДанныхАкта;
	
КонецФункции

Функция СтруктураДанныхФайла(вхФайл) 
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_СтруктураДанныхФайла";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураДанныхФайла = Новый Структура;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(вхФайл.ПолноеИмя,,,);
	
	ДеревоФайла = ПрочитатьXMLВДеревоЗначений(вхФайл.ПолноеИмя);
	ТЗФайла = ПрочитатьДеревоВТЗ(ДеревоФайла, "", "");
	
	ИмяПолучено 		= Ложь;
	ЗначениеПолучено 	= Ложь;
	Для каждого СтрокаТЗ ИЗ ТЗФайла Цикл
		
		Если СтрокаТЗ.Путь = "variable-list.crmcompany-variable.crm-oid" Тогда
			СтруктураДанныхФайла.Вставить("Элмакод", СтрокаТЗ.Значение);
		КонецЕсли;
		
		Если СтрНайти(СтрокаТЗ.Путь,  "variable-list.") = 0 Тогда
			Продолжить;
		ИначеЕсли СтрНайти(СтрокаТЗ.Путь,  "variable-list.crmcompany") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если  СтрНайти(СтрокаТЗ.Путь,  "name") = 0 Тогда
			ЗначениеСвойства = СтрокаТЗ.Значение;
			ЗначениеПолучено = Истина;
		Иначе
			ИмяСвойства = СтрокаТЗ.Значение;
			ИмяПолучено = Истина;
		КонецЕсли;	
		
		Если ИмяПолучено И ЗначениеПолучено Тогда
			
			СтруктураДанныхФайла.Вставить(ИмяСвойства, ЗначениеСвойства);
			
			ИмяПолучено 		= Ложь;
			ЗначениеПолучено 	= Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат СтруктураДанныхФайла;
	
КонецФункции

//Ответ
Функция ОтправитьОтвет(ИмяФайла, Штрихкод, АктЗаписан, НомераДокументовКлиентаПолучены, ТекстОшибки)
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ОтправитьОтвет";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Успешно = Истина;
	
	СтруктураОтвета = ИнициализироватьСтруктуруОтвета();	
	СтруктураОтвета.IDZaprosa 						= Штрихкод;
	СтруктураОтвета.success_akt 					= АктЗаписан;
	СтруктураОтвета.success_client_docs_numbers 	= НомераДокументовКлиентаПолучены;
	СтруктураОтвета.error 							= ТекстОшибки;
	
	
	ИмяФайлаОтвета = "result_"+ИмяФайла+".xml";
	СоздатьКаталог(КаталогОбмена +"\result");
	ПолноеИмяФайлаОтвета = КаталогОбмена +"\result\"+ ИмяФайлаОтвета;
	
	Попытка
		ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(СтруктураОтвета);
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.ОткрытьФайл(ПолноеИмяФайлаОтвета); 
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
		ЗаписьXML.Закрыть();
	Исключение 
		Успешно = Ложь;
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ИнициализироватьСтруктуруОтвета()
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ИнициализироватьСтруктуруОтвета";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураОтвета = Новый Структура;
	 СтруктураОтвета.Вставить("IDZaprosa", 						"");
	 СтруктураОтвета.Вставить("success_akt", 					Ложь);
	 СтруктураОтвета.Вставить("success_client_docs_numbers",	Ложь);
	 СтруктураОтвета.Вставить("error",							"");
	 
	 Возврат СтруктураОтвета;
	
 КонецФункции
 
 Функция СоответствиеПричинВозврата()
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_СоответствиеПричинВозврата";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СоответствиеПричинВозврата = Новый Соответствие;
	 СоответствиеПричинВозврата.Вставить("БракДоУстановки", Справочники.ПричиныВозврата.БракВыявленныйДоУстановки); // 2.1
	 СоответствиеПричинВозврата.Вставить("БракПослеУстановки", Справочники.ПричиныВозврата.БракВыявленныйПослеУстановки);// 2.2
	 СоответствиеПричинВозврата.Вставить("НесоблюдениеСроков", Справочники.ПричиныВозврата.НарушенСрокПоставки); // 7
	 СоответствиеПричинВозврата.Вставить("Ошибка заказа (возврат товара с уценкой)", Справочники.ПричиныВозврата.ОтказОтДетали); //  6
	 СоответствиеПричинВозврата.Вставить("Пересортица", Справочники.ПричиныВозврата.Пересортица);  //  5
	 СоответствиеПричинВозврата.Вставить("Подозрение на контрафакт", Справочники.ПричиныВозврата.ПодозрениеНаКонтрафакт); // 8
	 
	 СоответствиеПричинВозврата.Вставить("5", Справочники.ПричиныВозврата.БракВыявленныйПриПолученииТовара);// 1
	// СоответствиеПричинВозврата.Вставить("6", Справочники.ПричиныВозврата.Некомплект); // 4
	 СоответствиеПричинВозврата.Вставить("7", Справочники.ПричиныВозврата.Недогруз); //  3
	 СоответствиеПричинВозврата.Вставить("1", Справочники.ПричиныВозврата.Некомплект); //  3
	 
	 Возврат СоответствиеПричинВозврата;
	 
 КонецФункции
 
 //Прочее
 
// Для разбора XML, полученного с помощью функции ПрочитатьXMLВДеревоЗначений()
Функция ПрочитатьДеревоВТЗ(Дерево, ИмяТэгаСтрокиТаблицы = "", ИмяРеквизитаНомерСтроки = "") Экспорт
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ПрочитатьДеревоВТЗ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Путь", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("НомерСтрокиТаблицы", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Значение");
	
	СтруктураИменТаблиц = Новый Структура;
	Если ЗначениеЗаполнено(ИмяТэгаСтрокиТаблицы) Тогда
		СтруктураИменТаблиц.Вставить(ИмяТэгаСтрокиТаблицы, ИмяРеквизитаНомерСтроки);
	КонецЕсли;
	
	Путь = "";
	НомерСтрокиТаблицы = 0;
	ИмяТаблицы = "";
	ДобавитьСтрокиДереваВТЗ(Дерево.Строки[0].Строки, ТЗ, Путь, ИмяТаблицы, НомерСтрокиТаблицы, СтруктураИменТаблиц);
	
	Возврат ТЗ;
	
КонецФункции // ПрочитатьДеревоВТЗ()

Функция ДобавитьСтрокиДереваВТЗ(КоллекцияСтрок, ТЗ, ИсходныйПуть, ИмяТаблицы, НомерСтрокиТаблицы, СтруктураИменТаблиц)
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ДобавитьСтрокиДереваВТЗ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Для каждого СтрокаДерева Из КоллекцияСтрок Цикл
		
		Реквизит = СтрокаДерева.Реквизит;
		Значение = СтрокаДерева.Значение;
		
		Путь = ИсходныйПуть + ?(ЗначениеЗаполнено(ИсходныйПуть), ".", "") + Реквизит;
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Путь = Путь;
		НоваяСтрока.Значение = Значение;
		НоваяСтрока.ИмяТаблицы = ИмяТаблицы;
		НоваяСтрока.НомерСтрокиТаблицы = НомерСтрокиТаблицы;
		
		ИмяРеквизитаНомерСтроки = "";
		Попытка
			ЕстьСвойство = СтруктураИменТаблиц.Свойство(Реквизит, ИмяРеквизитаНомерСтроки);
		Исключение
			ЕстьСвойство = Ложь;
		КонецПопытки;
		
		Если ЕстьСвойство = Истина Тогда
			ИмяТаблицы = Реквизит;
			СтрокаНомераСтроки = СтрокаДерева.Строки.Найти(ИмяРеквизитаНомерСтроки);
			Если СтрокаНомераСтроки <> Неопределено Тогда
				НомерСтрокиТаблицы = НомерСтрокиТаблицы + 1;
			Иначе
				НомерСтрокиТаблицы = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		ДобавитьСтрокиДереваВТЗ(СтрокаДерева.Строки, ТЗ, Путь, ИмяТаблицы, НомерСтрокиТаблицы, СтруктураИменТаблиц);
		
		Если ЕстьСвойство = Истина Тогда
			ИмяТаблицы = "";
		КонецЕсли;
		
	КонецЦикла; 
	
КонецФункции // ДобавитьСтрокиДереваВТЗ()

Функция ПрочитатьXMLВДеревоЗначений(ИмяФайла) Экспорт
	
	лКлючАлгоритма = "Обработка_ЗагрузкаАРВССайта_МодульОбъекта_ПрочитатьXMLВДеревоЗначений";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ДЗ = Новый ДеревоЗначений;
	ДЗ.Колонки.Добавить("Реквизит");
	ДЗ.Колонки.Добавить("Тип");
	ДЗ.Колонки.Добавить("Значение");
	
	Реквизит = "";
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайла);
	Строки = ДЗ.Строки;
	Строки.Очистить();
	НоваяСтрока = ДЗ;
	Пока Чтение.Прочитать() Цикл
		
		ТипУзла = Чтение.ТипУзла;
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента 
			ИЛИ ТипУзла = ТипУзлаXML.КонецЭлемента
			Тогда
			Реквизит = СокрЛП(Чтение.Имя);
		КонецЕсли;
		//Если Реквизит = "response" Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Значение = СокрЛП(Чтение.Значение);
		
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НоваяСтрока = НоваяСтрока.Строки.Добавить();
			НоваяСтрока.Реквизит = Реквизит;
			НоваяСтрока.Тип = "Узел";
			Если Чтение.КоличествоАтрибутов() <> 0 Тогда
				Строки = НоваяСтрока.Строки;
				Пока Чтение.ПрочитатьАтрибут() Цикл
					Атрибут = Строки.Добавить();
					Атрибут.Реквизит = Чтение.Имя;
					Атрибут.Значение = Чтение.Значение;
					Атрибут.Тип = "Атрибут";
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если НоваяСтрока.Родитель = Неопределено Тогда
				НоваяСтрока = ДЗ;
			Иначе
				НоваяСтрока = НоваяСтрока.Родитель;
			КонецЕсли;
		Иначе
			НоваяСтрока.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
	Чтение.Закрыть();	
	
	Возврат ДЗ;
	
КонецФункции // ПрочитатьXMLВДеревоЗначений(ИмяФайла)

//***********************************************************
//	ПРЕОБРАЗОВАНИЕ ЗНАЧЕНИЙ

Функция ДатаXML_в_Дата1С(Строка) Экспорт
	
	Если ТипЗнч(Строка) = Тип("Дата") Тогда	
		Возврат Строка;
	КонецЕсли;
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Дата(1,1,1);
	Иначе
		Возврат Дата(Лев(Строка,4),Сред(Строка,6,2),Сред(Строка,9,2));
	КонецЕсли;	
	
КонецФункции

Функция ДатаXML_в_ДатаВремя1С(Строка) Экспорт
	
	Если ТипЗнч(Строка) = Тип("Дата") Тогда	
		Возврат Строка;
	КонецЕсли;
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Дата(1,1,1);
	Иначе
		
		Если СтрДлина(Строка) = 10 Тогда
			Возврат Дата(Лев(Строка,4),Сред(Строка,6,2),Сред(Строка,9,2));
		Иначе
			Возврат Дата(Лев(Строка,4),Сред(Строка,6,2),Сред(Строка,9,2),Сред(Строка,12,2),Сред(Строка,15,2),Сред(Строка,18,2));
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецФункции

Функция Дата1С_в_ДатаXML(Дата) Экспорт
	
	Если ТипЗнч(Дата) = Тип("Строка") Тогда
		
		Возврат Дата;
		
	ИначеЕсли ТипЗнч(Дата) = Тип("Дата") Тогда
		
		Возврат Формат(Дата,"ДФ=yyyy-MM-dd");
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция Дата1С_в_ВремяXML(Дата) Экспорт
	
	Возврат Формат(Дата,"ДФ=ЧЧ:мм:сс")+".000";
	
КонецФункции

Функция Дата1С_в_ДатаВремяXML(Дата) Экспорт
	
	ДатаXML		= Дата1С_в_ДатаXML(Дата);
	ВремяXML	= Дата1С_в_ВремяXML(Дата);
	
	Возврат ДатаXML+"T"+ВремяXML+"Z";
	
КонецФункции

КаталогОбмена = ВозвратыОтПокупателяСервер.КаталогОбменаССайтом(Ложь, Истина, 1);

мЗаписыватьИсториюОбмена = Константы.ИспользоватьИсторияОбменаССайтомВозвраты.Получить();
//
